/* App */
"app.name" = "Synca";
"app.slogan" = "Sync Your Aha Moment";

/* Login */
"login.sign_in_with_apple" = "Sign in with Apple";
"login.failed" = "Sign In Failed";
"login.failed_message" = "Please try again later";
"auth.missing_credentials" = "Unable to retrieve Apple sign-in credentials";

/* Common */
"common.ok" = "OK";
"common.cancel" = "Cancel";
"common.delete" = "Delete";
"common.copy" = "Copy";
"common.save" = "Save";
"common.done" = "Done";
"common.all" = "All";
"message.date.yesterday" = "Yesterday %@";

/* Message List */
"message_list.todo_section" = "Inbox";
"message_list.sync_success" = "Synced";
"message_list.sync_failed" = "Sync Failed";
"message_list.error_too_long" = "Message must be %d characters or less.";
"message_list.loading" = "Loading...";
"message_list.clear_all_confirm_title" = "Confirm Delete";
"message_list.clear_all_confirm_message" = "This will delete all completed to-dos";
"message_list.clear_completed_all_categories" = "Delete completed items in all categories.";
"message_list.clear_completed_category_format" = "Delete completed items in %@.";
"message_list.clear_completed_all_messages" = "Delete completed items in all messages.";
"message_list.logout_confirm_title" = "Confirm Sign Out";
"message_list.logout_confirm_message" = "You will need to sign in again";
"message_list.logout" = "Sign Out";
"message_list.about" = "About Synca";
"message_list.feedback" = "Feedback";
"message_list.sign_out" = "Sign Out";
"message_list.session_expired_title" = "Session Expired";
"message_list.session_expired_message" = "Please sign in again to continue";
"message_list.sign_in_again" = "Sign In Again";
"message_list.got_it" = "Got It";
"message_list.about_version_format" = "Version %@ (%@)";
"message_list.about_website_hint" = "Open Synca Web in your default browser";
"message_list.about_message" = "\nSynca · Sync Your Aha Moment\n\nVersion %@ (%@)\n\nhttps://synca.haerth.cn/";
"message_list.input_placeholder" = "Capture your thoughts...";
"message_list.sending_placeholder" = "Sending...";
"message_list.manage_categories" = "Categories";
"account.section_title" = "Account";
"account.provider.apple" = "Signed in with Apple";
"account.email_unavailable" = "Apple account email unavailable";
"account.email_hidden_title" = "Email Hidden by Apple";
"account.email_hidden_message" = "This account is using Hide My Email. Your real email address is not shared with Synca.";
"account.delete_action" = "Delete Account";
"account.delete_confirm_title" = "Delete Account";
"account.delete_confirm_message" = "This permanently deletes your Synca account and removes your synced messages, files, categories, feedback, and session data from Synca servers. This action cannot be undone.";
"account.delete_success_title" = "Account Deleted";
"account.delete_success_message" = "Your Synca account and associated data have been deleted.";
"account.delete_failed_title" = "Unable to Delete Account";
"account.delete_failed_message" = "Please try again later.";
"sync.error_context.sync" = "Sync";
"sync.error_context.send" = "Send";
"sync.error_context.send_image" = "Image Send";
"sync.error_context.send_file" = "File Send";
"sync.error_context.clear" = "Clear";
"sync.error_context.delete" = "Delete";
"sync.error_format" = "%@ failed: %@ (Code: %d, Domain: %@)";
"sync.batch_send_partial_failure" = "Batch send finished, but %d images failed to send";
"api.invalid_response" = "Invalid server response";
"api.unauthorized" = "Session expired. Please sign in again";
"api.http_error" = "Request failed (%d): %@";
"access.center_title" = "Synca Unlimited";
"access.status_trial" = "Trial · %d days left";
"access.status_free" = "Free · %d/%d today";
"access.status_unlimited" = "Unlimited";
"access.status_unlimited_badge" = "Unlimited";
"access.status_trial_inline" = "Trial %dd";
"access.status_free_inline" = "Free %d/%d";
"access.status_unlimited_inline" = "∞";
"access.status_trial_compact" = "Trial %dd";
"access.status_free_compact" = "Free %d/%d";
"access.status_unlimited_compact" = "Unlimited";
"access.trial_description" = "You are still in your 7-day unlimited trial. %d day(s) remaining.";
"access.free_description" = "You can add up to %d/%d messages today.";
"access.current_plan_title" = "Current Plan";
"access.current_free_summary" = "Today %d/%d";
"access.free_daily_rule" = "Add up to 20 new messages per day";
"access.free_title" = "Free";
"access.trial_rule" = "Unlimited captures during trial · %d day(s) left";
"access.free_rule" = "Add up to %d new messages per day";
"access.free_usage" = "Today's usage: %d/%d";
"access.free_keep_access" = "Viewing, syncing, clearing, and deleting existing messages always remain available";
"access.free_reset_hint" = "Your free allowance resets automatically every day";
"access.unlock_title" = "Unlock Unlimited";
"access.unlock_benefit_unlimited" = "Unlimited new messages";
"access.unlock_benefit_cross_device" = "Keep using the same access across iPhone and Mac";
"access.unlock_benefit_capture_anytime" = "Capture whenever inspiration hits";
"access.purchase_shared_account" = "One purchase unlocks Synca across iPhone and Mac";
"access.shared_base_feature" = "All plans include sync, image attachments, and history access";
"access.shared_future_feature" = "Includes all future premium features as they ship";
"access.subscription_info_title" = "Subscription Information";
"access.subscription_info_format" = "Auto-renewing %@ subscription at %@.";
"access.billing_period_monthly" = "1 month";
"access.billing_period_yearly" = "1 year";
"access.subscription_manage_hint" = "Subscriptions renew automatically unless canceled at least 24 hours before the end of the current period. Manage or cancel anytime in your App Store account settings.";
"access.privacy_policy_link_title" = "Privacy Policy";
"access.terms_link_title" = "Terms of Use";
"access.purchase_options_title" = "Purchase Options";
"access.purchase_shared_hint" = "Available across all your devices on the same account.";
"access.option_monthly_title" = "Unlimited (Monthly)";
"access.option_monthly_subtitle" = "Monthly subscription. Cancel anytime.";
"access.option_yearly_title" = "Unlimited (Yearly)";
"access.option_yearly_subtitle" = "Yearly subscription. Renews once a year.";
"access.intro_free_trial_then_template" = "%@ free, then %@ / %@. Auto-renews until canceled.";
"access.intro_payg_then_template" = "Intro offer for %@, then %@ / %@.";
"access.intro_payupfront_then_template" = "Intro price for %@, then %@ / %@.";
"access.subscription_renews_template" = "%@ / %@. Auto-renews until canceled.";
"access.option_lifetime_title" = "Lifetime";
"access.option_lifetime_subtitle" = "One-time purchase. Permanent access.";
"access.purchase_setup_pending" = "App Store purchase setup is the next step.";
"access.buy_for_price" = "Buy for %@";
"access.restore_purchases" = "Restore Purchases";
"access.purchase_fetch_failed" = "Unable to load App Store products right now.";
"access.purchase_unavailable" = "Purchase is temporarily unavailable.";
"access.purchase_unavailable_short" = "Unavailable";
"access.purchase_failed" = "Purchase failed. Please try again.";
"access.purchase_pending" = "Purchase is pending approval.";
"access.purchase_verification_failed" = "Purchase verification failed.";
"access.purchase_account_missing" = "Your account needs to be refreshed before purchasing.";
"access.offer_unavailable" = "This special offer isn't available right now.";
"access.lifetime_offer_copied" = "Your offer code has been copied. Paste it into the redemption sheet.";
"access.restore_success" = "Your App Store purchases have been restored.";
"access.restore_no_purchases" = "No purchases were found to restore for this account.";
"access.restore_failed" = "Unable to restore purchases right now.";
"access.purchased_monthly" = "Unlimited (Monthly)";
"access.purchased_yearly" = "Unlimited (Yearly)";
"access.purchased_lifetime" = "Lifetime";
"access.unlimited_title" = "Unlimited";
"access.unlimited_description" = "You have unlimited capture access across all your devices.";
"access.subscription_billing_label" = "Billing";
"access.purchase_date_label" = "Purchase date";
"access.subscription_expires_label" = "Next renewal";
"access.purchase_date" = "Purchased on %@";
"access.subscription_expires" = "Renews / expires on %@";
"access.switch_to_yearly" = "Switch to Yearly";
"access.switch_to_monthly" = "Switch to Monthly";
"access.lifetime_upgrade_title" = "Upgrade to Lifetime";
"access.upgrade_to_lifetime" = "Upgrade to Lifetime";
"access.upgrade_to_lifetime_offer" = "Upgrade to Lifetime (Special Offer)";
"access.offer_code_label" = "Subscriber exclusive offer code";
"access.copy_offer_code" = "Copy";
"access.offer_code_hint" = "We'll copy your one-time code and open the in-app redemption sheet.";
"access.offer_code_redeem_hint" = "Redeem your exclusive offer to upgrade to Lifetime.";
"access.intro_offer_badge" = "1 month free";
"access.limit_reached_title" = "Today's free limit reached";

/* Feedback */
"feedback.title" = "Send Feedback";
"feedback.submit" = "Submit";
"feedback.content_title" = "Feedback";
"feedback.content_placeholder" = "Tell us what happened or what you'd like to see.";
"feedback.images_title" = "Images";
"feedback.add_images" = "Add images";
"feedback.add_more_images" = "Add more images";
"feedback.images_limit" = "%d/%d images attached";
"feedback.email_title" = "Email";
"feedback.email_placeholder" = "Required for follow-up";
"feedback.error_content_required" = "Please enter your feedback.";
"feedback.error_content_too_long" = "Feedback must be %d characters or less.";
"feedback.error_email_required" = "Please enter a valid email address.";
"feedback.submit_failed" = "Unable to submit feedback right now.";
"feedback.submit_success" = "Feedback sent";

/* Message Bubble */
"message_bubble.delete_confirm_title" = "Confirm Delete";
"message_bubble.delete_confirm_message" = "This will permanently delete this record%@ from the cloud and cannot be undone.";
"message_bubble.delete_image_suffix" = " and image file";
"message_bubble.load_failed_retry" = "Load failed, tap to retry";
"message_bubble.open_with_preview" = "Open with Preview";
"message_bubble.show_in_finder" = "Show in Finder";
"message_bubble.save_as" = "Save As...";
"message_bubble.save_failed_title" = "Save Failed";
"message_bubble.save_failed_message" = "Unable to save image to the specified directory: %@\n\nThis is most likely due to insufficient permissions. You can try \"Save As\" to re-authorize.";
"message_bubble.choose_save_directory" = "Choose Save Directory";
"message_bubble.save_to_directory" = "Save to This Directory";
"message_file.error_too_large" = "Files must be 25 MB or smaller.";
"message_file.error_image_too_large" = "Images must be 20 MB or smaller.";
"message_file.error_unsupported" = "This file type is not supported.";

/* Message Categories */
"message_category.section_title" = "Categories";
"message_category.manage_description" = "Edit category names and colors, then save all changes at once.";
"message_category.new_section" = "New Category";
"message_category.name_placeholder" = "Category name";
"message_category.color_label" = "Color";
"message_category.name_column" = "Name";
"message_category.add_action" = "Add Category";
"message_category.save_name" = "Save Name";
"message_category.delete_action" = "Delete Category";
"message_category.move_up" = "Move Up";
"message_category.move_down" = "Move Down";
"message_category.default_badge" = "Default";
"message_category.duplicate_title" = "Category Already Exists";
"message_category.duplicate_message" = "Use a different category name.";
"message_category.invalid_title" = "Category Name Required";
"message_category.invalid_message" = "Each category needs a name before saving.";
"message_category.delete_confirm_title" = "Delete Category?";
"message_category.delete_confirm_message" = "This category will be removed after you save.";
"message_category.color.sky" = "Sky";
"message_category.color.mint" = "Mint";
"message_category.color.amber" = "Amber";
"message_category.color.coral" = "Coral";
"message_category.color.violet" = "Violet";
"message_category.color.slate" = "Slate";
"message_category.color.rose" = "Rose";
"message_category.color.ocean" = "Ocean";

/* Image Preview */
"image_preview.download_to_local" = "Download";
"image_preview.saving" = "Saving...";
"image_preview.save_success" = "Saved";
"image_preview.save_failed" = "Save Failed";
"image_preview.load_failed" = "Image Load Failed";
"image_preview.tap_to_retry" = "Tap to Retry";

"common.send" = "Send";
